МояРазработка.АрутюновУниверсальныйОтчет/src/Reports/УО_УниверсальныйОтчет/УО_УниверсальныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>УО_УниверсальныйОтчет</name>
</mdclass:Report>

МояРазработка.АрутюновУниверсальныйОтчет/src/InformationRegisters/УО_ХранилищеСхем/УО_ХранилищеСхем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УО_ХранилищеСхем</name>
  <resources>
    <name>Схема</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>РегистрацияСхемы</name>
    <type>
      <types>CatalogRef.УО_РегистрацияСхемы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МояРазработка.АрутюновУниверсальныйОтчет/src/Reports/УО_УниверсальныйОтчет/ManagerModule.bsl
Процедура ПолучитьСписокМакетов(Список) Экспорт

	Для каждого ОбъектМетаданных Из Метаданные.Отчеты.УО_УниверсальныйОтчет.Макеты Цикл
		Список.Добавить(ОбъектМетаданных.Имя, ОбъектМетаданных.Представление());
	КонецЦикла;

КонецПроцедуры

// Вытаскиваем схему под соответствующего пользователя
Функция ТекущаяСхема() Экспорт

	ИмяСхемы = ИмяСхемы();
	
	Если ИмяСхемы <> Неопределено Тогда
		ИдентификаторСхемы = Новый УникальныйИдентификатор(ИмяСхемы);
		РегистрацияСхемы = Справочники.УО_РегистрацияСхемы.ПолучитьСсылку(ИдентификаторСхемы);
		Возврат РегистрыСведений.УО_ХранилищеСхем.Схема(РегистрацияСхемы);
	КонецЕсли;
	
КонецФункции

// Событие до создания формы
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	// Сохранение имени
	Если Параметры.Свойство("КлючНазначенияИспользования") Тогда
		ХранилищеОбщихНастроек.Сохранить("Отчет.УО_УниверсальныйОтчет.ТекущаяСхема",,
			Параметры.КлючНазначенияИспользования,,ИмяПользователя());
	Иначе
		Параметры.Вставить("КлючНазначенияИспользования", ИмяСхемы());
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "ФормаОтчета";
	КонецЕсли;

КонецПроцедуры

Функция ИмяСхемы()

	Возврат ХранилищеОбщихНастроек.Загрузить("Отчет.УО_УниверсальныйОтчет.ТекущаяСхема",,,
		ИмяПользователя());		

КонецФункции
